---
kind: property
id: P:Autodesk.Revit.DB.FabricationServiceButton.ServiceId
source: html/1614acd6-c63d-4d96-c39d-82fc4dec0089.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.ServiceId Property

The fabrication service identifier for the fabrication service this button belongs to.

## Syntax (C#)
```csharp
public int ServiceId { get; }
```